rheoTool/tutorials/rheoFoam/OtherTests/Channel2D_VE/otherModels/sPTT-IKH/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{                
               type             sPTT-IKH;
               
               rho              rho [1 -3 0 0 0 0 0] 1000; 

               etaS             etaS [1 -1 -1 0 0 0 0] 0.; // (original model does not have etaS)
               
               // Parameters for fumed silica suspensions by Wei et al. (from Journal of Rheology 63, 609 (2019); doi: 10.1122/1.5049136)
               eta0             eta0 [1 -1 -1 0 0 0 0] 3.519;
               G                G [1 -1 -2 0 0 0 0] 71.586;
               k0               k0 [1 -1 -2 0 0 0 0] 0.416;
               epsilon          epsilon [0 0 0 0 0 0 0] 0.05;
               C0               C0 [1 -1 -2 0 0 0 0] 0.438;
               q                q [0 0 0 0 0 0 0] 2.052;
               k1               k1 [0 0 -1 0 0 0 0] 1.25e-3;
               k2               k2 [0 0 -1 0 0 0 0] 2e-5;
               k3               k3 [0 0 -1 0 0 0 0] 6.839;
               n1               n1 [0 0 0 0 0 0 0] 1.844;
               n2               n2 [0 0 0 0 0 0 0] 2.676;
               n3               n3 [0 0 0 0 0 0 0] 4.128;
               m1               m1 [0 0 0 0 0 0 0] 0.484;
               m2               m2 [0 0 0 0 0 0 0] 0.639;
               m3               m3 [0 0 0 0 0 0 0] 0.01;
             
               stabilization    coupling;              
               etaStab          etaStab [1 -1 -1 0 0 0 0] 3.519; // Make it equal to eta0    
}

passiveScalarProperties
{
                solvePassiveScalar   no;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
